In [1]:
import pandas as pd
from pandas import DataFrame, Series

In [15]:
product_id = '11, 12, 13, 14, 15'.split(', ')
product_id

['11', '12', '13', '14', '15']

In [20]:
product_name = 'Lamp Stand Chair Table Bed'.split()
whole_price = '10 15 20 30 50'.split()
retail_price = '12 17 23 35 57'.split()
number_of_sales = '5 1 3 1 2'.split()

In [49]:
df = pd.DataFrame({'Id':product_id, 
                   'Item':product_name, 
                   'W_price': whole_price, 
                   'R_price': retail_price,
                   'Sales': number_of_sales})
df

   Id   Item W_price R_price Sales
0  11   Lamp      10      12     5
1  12  Stand      15      17     1
2  13  Chair      20      23     3
3  14  Table      30      35     1
4  15    Bed      50      57     2

In [50]:
df['Revenues'] = (df['R_price'].astype('int') - df['W_price']. astype('int')) * df['Sales'].astype('int')

In [51]:
df

   Id   Item W_price R_price Sales  Revenues
0  11   Lamp      10      12     5        10
1  12  Stand      15      17     1         2
2  13  Chair      20      23     3         9
3  14  Table      30      35     1         5
4  15    Bed      50      57     2        14

In [55]:
df['Revenues'].sum()

40

In [61]:
df['W_price']= df['W_price'].astype('int')
df['R_price']= df['R_price'].astype('int')
df['Sales']= df['Sales'].astype('int')

In [62]:
df['Sales']

0    5
1    1
2    3
3    1
4    2
Name: Sales, dtype: int64

# Beyond 1
### For what products is the retail price more than twice the wholesale price?

In [65]:
df[(df['R_price'] - df['W_price']) > 2]

   Id   Item  W_price  R_price  Sales  Revenues
2  13  Chair       20       23      3         9
3  14  Table       30       35      1         5
4  15    Bed       50       57      2        14

# Beyond 2
### How much did the store make from chair versus table versus bed? (You can retrieve based on the index values, not anything more sophisticated.)

In [70]:
df.loc[2, 'Revenues'] - df.loc[3, 'Revenues']

4

In [71]:
df.loc[3, 'Revenues'] - df.loc[4, 'Revenues']

-9

# Beyond 3
### Because your store is doing so well, you can negotiate a 30% discount on the wholesale price of goods. Calculate the new net income.

In [74]:
df['New_revenues'] = (df['R_price'] - (df['W_price'] * 0.7)) * df['Sales']

In [75]:
df

   Id   Item  W_price  R_price  Sales  Revenues  New_revenues
0  11   Lamp       10       12      5        10          25.0
1  12  Stand       15       17      1         2           6.5
2  13  Chair       20       23      3         9          27.0
3  14  Table       30       35      1         5          14.0
4  15    Bed       50       57      2        14          44.0

In [76]:
df['New_revenues'].sum()

116.5